Repository: Belarus/OmegaT-Common.TMX
Catalog: tmx/non-segmented/drupal-7.x.tmx
Source language: en
Languages: be

source: Developers of field modules can either use the default <a href="@sql-store">Field SQL storage module</a> to store data for their fields, or a contributed or custom module developed using the <a href="@storage-api">field storage API</a>.
be: Распрацоўшчыкі модуляў палёў могуць выкарыстоўваць альбо модуль <a href="@sql-store">Field SQL storage</a> па змоўчанні для захавання дадзеных іхніх палёў, альбо свае ўласна распрацаваныя модулі, створаныя з выкарыстаннем<a href="@storage-api">API сховішча палёў</a>.

source: Development
be: Распрацоўка

source: Development tools.
be: Прылады распрацоўкі.

source: Development version:
be: Версія для распрацоўнікаў:

source: Did not delete temporary file "%path" during garbage collection, because it is in use by the following modules: %modules.
be: Часовы файл "%path" не быў выдалены падчас зборкі смецця, так як выкарыстоўваецца наступнымі модулямі: %modules.

source: Did not find field by id @id
be: Па id @id поле не знойдзена

source: Did not find field by name @name
be: Поле з імём @name не знойдзена

source: Digest
be: Дайджэст

source: Direction
be: Накірунак

source: Direction that text in this language is presented.
be: Накірунак, у якім прадстаўлены тэкст на гэтай мове.

source: Disable
be: Выключыць

source: Disable !theme theme
be: Выдаліць !theme тэму

source: Disable text format
be: Адключыць тэкставы фармат

source: Disable the account and keep its content.
be: Адключыць акаўнт і захаваць яго змест

source: Disable the account and unpublish its content.
be: Дэактываваць рахунак і перавесьці яго змест у неапублікаваны стан.

source: Disable theme
be: Адключыць тэму

source: Disabled
be: Выключана

source: Disabled modules
be: Адключаныя модулі

source: Disabled text format %format.
be: Адключаны тэкставы фармат %format.

source: Disabled text formats are completely removed from the administrative interface, and any content stored with that format will not be displayed. This action cannot be undone.
be: Адключаны тэкставы фармат цалкам выдалены з адміністратыўнага інтэрфейсу, і кожнае змесціва, якое ўтрымлівае ў сабе гэты фармат, ня будзе адлюстроўвацца. Гэта дзеянне ня можа быць адменена.

source: Disabled theme
be: Тэма ўключаная

source: Disabled themes
be: Тэмы адключаныя

source: Disabled: %disabled
be: Адключана: %disabled

source: Discard access logs older than
be: Адкінуць запісы рэгістру дасягу, старэйшыя за

source: Discard items older than
be: Адхіліць элемент старэйшы за

source: Dismiss this message.
be: Ігнараваць гэта паведамленне.

source: Display
be: Паказ

source: Display HTML help
be: Паказваць даведку HTML

source: Display a message to the user
be: Паказваць паведамленне карыстальніку

source: Display above and below the comments
be: Зьмясьціць над ды пад камэнтарамі

source: Display above the comments
be: Зьмясьціць над камэнтарамі

source: Display any HTML as plain text
be: Адлюстраваць любы HTML як просты тэкст

source: Display author and date information.
be: Адлюстраваць інфармацыю аб аўтары і даце.

source: Display basic HTML help in long filter tips
be: Паказваць дапамогу па базавым HTML

source: Display below post or comments
be: Адлюстраваць пад запісам або камэнтарамі

source: Display below the comments
be: Зьмясьціць пад камэнтарамі

source: Display fields
be: Праглядзець палі

source: Display of XML feed items
be: Адлюстраваньне элементаў XML - стужкі

source: Display on separate page
be: Адлюстраваць на асобнай старонцы

source: Display on user registration form.
be: Паказваць рэгістрацыйную форму карыстальніка

source: Display post information on
be: Паказаць інфармацыю па допісе

source: Display prefix and suffix.
be: Паказаць прэфіксы і суфіксы.

source: Display settings
be: Наладкі паказа

source: Display the comment as RSS.
be: Паказаць каментар як RSS.

source: Display the comment with standard comment view.
be: Паказаць каментар у стандартным выглядзе.

source: Display the results as a slideshow.
be: Паказаць вынікі ў выглядзе слайдаў.

source: Display the view as a block.
be: Паказаць віды ў выглядзе блока.

source: Display the view as a feed, such as an RSS feed.
be: Паказаць віды ў выглядзе стужкі, напрыклад у выглядзе RSS стужкі.

source: Display the view as a page, with a URL and menu links.
be: Паказаць выгляд як старонку з URL і спасылкамі меню.

source: Display with prefix and suffix.
be: Паказаць з прэфіксамі і суфіксамі.

source: Displayed as
be: Паказаць як

source: Displayed as %date
be: Паказаць як %date

source: Displaying administrative links
be: Адлюстраванне адміністрацыйнай спасылкі

source: Displaying contextual links
be: Адлюстраванне кантэкстуальных спасылак.

source: Displaying menus
be: Адлюстраўванне меню

source: Displaying popular content
be: Паказаць папулярныя матэрыялы

source: Displaying shortcuts
be: Адлюстраванне цэтлікаў

source: Displays rows as an HTML list.
be: Паказвае радкі у выглядзе HTML спісу.

source: Displays rows in a grid.
be: Паказвае радкі ў сетцы.

source: Displays rows in a table.
be: Паказвае радкі ў табліцы.

source: Displays rows one after another.
be: Паказваць радкі па чарзе.

source: Displays the Drupal administration interface in an overlay.
be: Паказвае адміністацыйны інтэрфейс Drupal у перакрываючым слоі.

source: Djibouti
be: Джыбуці

source: Do my action
be: Выканаць маё дзеянне

source: Do not display
be: Не адлюстроўваць

source: Do not know how to order on @key for @entity_type
be: Не ведаю, як запытаць @key для @entity_type

source: Domain
be: Дамен

source: Domain and path prefix values should not be set at the same time.
be: Значэнні дамена і прэфікса маршрута не павінны ўсталёўвацца адначасова.

source: Dominica
be: Дамініка

source: Dominican Republic
be: Дамініканская Рэспубліка

source: Don't display post information
be: Не паказваць інфармацыю паста

source: Done
be: Зроблена

source: Download
be: Загрузка

source: Download additional <a href="@modules">contributed modules</a> to extend Drupal's functionality.
be: Загрузіць дадатковыя <a href="@modules">модулі</a>, каб пашырыць функцыянальнасць Drupal.

source: Download method
be: Мэтад спампоўкі

source: Download these updates
be: Загрузіць гэтыя абнаўленні

source: Downloading %project
be: Загрузка %project

source: Downloading updates
be: Загрузка абнаўленняў

source: Downloading updates failed:
be: Загрузка аднаўленняў не атрымалася:

source: Downloads data from a URL using Drupal's HTTP request handler.
be: Загрузіце дадзеныя з URL, выкарыстоўваючы Drupal апрацоўшчык HTTP-запытаў.

source: Drag and drop these blocks to the columns below. Changes are automatically saved. More options are available on the <a href="@dashboard-url">configuration page</a>.
be: Перацягнуць і кінуць гэтыя блокі ў калонках ніжэй. Змены аўтаматычна захоўваюцца. Больш опцый даступна на <a href="@dashboard-url">старонцы канфігурацыі</a>.

source: Drag to re-order
be: Перацягнуць для паўторнага заказу

source: Drupal already installed
be: Drupal ужо інсталляваны

source: Drupal can make a block with the most recent news items of a feed. You can <a href="@block-admin">configure blocks</a> to be displayed in the sidebar of your page. This setting lets you configure the number of news items to show in a feed's block. If you choose '0' these feeds' blocks will be disabled.
be: У Drupal вы можаце стварыць блок з самымі апошнімі навіннымі пунктамі стужкі. Вы можаце <a href="@block-admin">наладзіць блокі</a> так, каб яны адлюстроўваліся ў сайдбары вашай старонкі. Гэта наладка дазваляе вам настраіваць колькасць навінных пунктаў, якія адлюстроўваюцца ў блоку фіда. Калі вы выберыце '0', гэтыя блокі стужак будуць адключаны.

source: Drupal can make a block with the most recent news items of this feed. You can <a href="@block-admin">configure blocks</a> to be displayed in the sidebar of your page. This setting lets you configure the number of news items to show in this feed's block. If you choose '0' this feed's block will be disabled.
be: Drupal можа ствараць блок з апошніх навінаў гэтага фіду. Вы можаце <a href="@block-admin">паказваць блок</a> у бакавых калонках на вашай старонцы. Гэтая наладка дазволіць вам устанавіць колькасць навінаў у гэтым фід блоку. Калі вы абярэце '0' гэты фід блок будзе схаваны.

source: Drupal core
be: Ядро Drupal

source: Drupal core update status
be: Стан абнаўлення ядра Drupal

source: Drupal could not be correctly setup with the existing database. Revise any errors.
be: Drupal не можа быць правільна наладжаны з існуючай базай дадзеных. Перагледзьце ўсе памылкі.

source: Drupal could not determine the encoding of the database was set to UTF-8
be: Drupal не можа вызначыць кадзіроўку базы дадзеных і ўсталяваў у UTF-8

source: Drupal requires you to enable the PHP extensions in the following list (see the <a href="@system_requirements">system requirements page</a> for more information):
be: Drupal патрабуе ўключыць PHP пашырэнні з наступнага спісу (глядзі <a href="@system_requirements">сістэмныя патрабаванні</a> па дадатковую інфармацыю):

source: Drupal system listing compatible test
be: Тэст сумяшчальнасці Drupal

source: Drupal system listing incompatible test
be: Тэст не сумяшчальнасці Drupal

source: Dutch
be: Галандская

source: E-mail
be: Адрас E-mail

source: E-mail address
be: Адрас E-mail

source: E-mail addresses to notify when updates are available
be: Адрасы электроннай пошты для апавяшчэння пры наяўнасці абнаўленняў

source: E-mail new password
be: Намыліць новы пароль.

source: E-mail notification threshold
be: Высылаць апавяшчэнне па электроннай пошце пры выкананні наступных крытэраў

source: E-mails
be: Электронная пошта

source: Each <a href='@content-type'>content type</a> can have its own default comment settings configured as: <em>Open</em> to allow new comments, <em>Hidden</em> to hide existing comments and prevent new comments, or <em>Closed</em> to view existing comments, but prevent new comments. These defaults will apply to all new content created (changes to the settings on existing content must be done manually). Other comment settings can also be customized per content type, and can be overridden for any given item of content. When a comment has no replies, it remains editable by its author, as long as the author has a user account and is logged in.
be: Кожны <a href='@content-type'>тып змесціва</a> можа мець свае ўласныя наладкі каментароў па змоўчанні канфігураваныя як: <em>Адкрытыя</em> - дазволіць новыя каментары, <em>Схаваныя</em> - схаваць існуючыя каментары і забараніць дадаваць новыя, ці <em>Закрытыя</em> - паказваць існуючыя каментары, але забараніць дадаваць новыя. Гэтыя наладкі будуць прымененыя да ўсяго новага змесціва (змяняць гэтыя наладкі для існуючага змесціва патрэбна ўручную). Іншыя наладкі каментароў можна таксама вызначыць для кожнага тыпу змесціва, і можна перакрыць для кожнага элементу гэтага змесціва. Калі каментар не адказаны, ён можа быть рэдагуемы аўтарам у любы час.

source: Each field can store one type of data (text, number, file, etc.). When you define a field, you choose a particular <em>field type</em>, which corresponds to the type of data you want to store. The field type cannot be changed after you have created the field.
be: Кожнае поле можа захоўваць адзін тып дадзеных (тэкст, лік, файл і г.д.). Калі вы вызначаеце поле, вы выбіраеце адмысловы <em>тып поля</em>, якія адносіцца да тыпу дадзеных, якія вы хочаце захоўваць. Тып поля ня можа быць зменяны пасля стварэння поля.

source: Each field type has one or more available <em>widgets</em> associated with it; each widget provides a mechanism for data input when you are editing (text box, select list, file upload, etc.). Each field type also has one or more display options, which determine how the field is displayed to site visitors. The widget and display options can be changed after you have created the field.
be: Кожны тып поля мае адзін або некалькі даступных <em>віджэтаў</em>, звязаных з ім; кожны віджэт ўяўляе сабой механізм для ўводу дадзеных пры рэдагаванні (тэкставае поле, спіс выбару, змяшчэнне на серверы файлаў і г.д.). Кожны тып поля таксама мае адну або некалькі наладак паказу, якія вызначаюць, як поле адлюстроўваецца наведвальнікам сайта. Віджэт і наладкі паказу можна змяніць пасля стварэння поля.

source: Each menu has a corresponding block that is managed on the <a href="@blocks">Blocks administration page</a>.
be: У кожнага меню ёсць адпаведны блок, якім кіруюць на <a href="@blocks">старонцы Адміністравання блокаў</a>.

source: Each taxonomy term automatically provides a page listing content that has its classification, and a corresponding RSS feed. For example, if the taxonomy term <em>country rock</em> has the ID 123 (you can see this by looking at the URL when hovering on the linked term, which you can click to navigate to the listing page), then you will find this list at the path <em>taxonomy/term/123</em>. The RSS feed will use the path <em>taxonomy/term/123/feed</em> (the RSS icon for this term's listing will automatically display in your browser's address bar when viewing the listing page).
be: Кожны тэрмін таксанаміі аўтаматычна прадастаўляе старонку раздрукоўкі змесціва, якое мае адпаведную класіфікацыю і адпавядае RSS-стужцы. Напрыклад, тэрмін таксанаміі <em>кантры рок</em> мае ID роўны 123 (Вы можаце бачыць яго на URL, калі наводзіце курсор мышы на спасылку тэрміна. Яго вы можаце пстрыкнуць для навігацыі старонкі раздрукоўкі). Калі вы будзеце знаходзіць шлях <em>taxonomy/term/123</em>. Стужка RSS будзе выкарыстоўваць шлях <em>taxonomy/term/123/feed</em> адпаведна. (Значка RSS для раздрукоўкі гэтага лістынгу будзе аўтаматычна адлюстроўвацца камандным радку праглядаемай старонкі).

source: Each text format uses filters to manipulate text, and most formats apply several different filters to text in a specific order. Each filter is designed for a specific purpose, and generally either adds, removes, or transforms elements within user-entered text before it is displayed. A filter does not change the actual content, but instead, modifies it temporarily before it is displayed. One filter may remove unapproved HTML tags, while another automatically adds HTML to make URLs display as clickable links.
be: Кожны тэкставы фармат выкарыстоўвае фільтры для кіравання тэкстам, і большасць фарматаў ужывае да тэксту некалькі розных фільтраў у вызначаным парадку. Кожны фільтр створаны для вызначанай мэты, і ў асноўным альбо дадае, выдаляе, альбо ператварае элементы ўнутры ўведзенага карыстальнікам тэксту перад тым, як ён будзе адлюстраваны. Фільтр не змяняе непасрэдна змесціва, а, замест гэтага, проста часова часткова змяняе яго перад тым, як яно будзе адлюстравана. Адзін фільтр можа выдаляць непацверджаныя тэгі HTML , у тый жа час другі аўтаматычна дадае HTML, каб прымусіць URL'ы адлюстроўвацца як клікабельныя спасылкі.

source: Each user's blog entries are automatically displayed with a link to the user's main blog page. You can create as many single-user blogs as you have site users with permission to create blog content.
be: Кожны запіс карыстальніка ў блогу аўтаматычна адлюстроўваецца са спасылкай да галоўнай старонкі блога карыстальніка. Вы можаце стварыць столькі аднакарыстальніцкіх блогаў, колькі карыстальнікаў, маючых доступ ствараць змесціва блогаў, зарэгістравана на сайце.

source: Ecuador
be: Эквадор

source: Edit
be: Рэдагаваць

source: Edit %label effect
be: Адрэдагаваць %label эфект

source: Edit %name style
be: Адрэдагаваць %name стыль

source: Edit %title
be: Редагаваць %title

source: Edit URL
be: Рэдагаваць URL

source: Edit a template
be: Рэдагаваць шаблон

source: Edit alias
be: Рэдагаваць аліас

source: Edit an existing effect within a style.
be: Рэдагаваць існуючы эфект унутры стылю.

source: Edit category
be: Змяніць катэгорыю

source: Edit comment
be: Рэдагаваць каментар

source: Edit comment %comment
be: Рэдагаваць каментар %comment

source: Edit contact category
be: Рэдагаваць катэгорыю кантактаў

source: Edit container
be: Адрэдагаваць кантэйнер

source: Edit content type
be: Змяніць тып зместу

source: Edit current shortcut set
be: Рэдагаваць дзейны набор цэтлікаў

source: Edit date format
be: Рэдагаваць фармат даты

source: Edit feed
be: Змяніць фід

source: Edit field
be: Рэдагаваць поле

source: Edit field settings.
be: Рэдагаваць наладкі поля.

source: Edit forum
be: Адрэдагаваць форум

source: Edit image effect
be: Рэдагаваць эфект малюнка

source: Edit instance settings.
be: Рэдагаваць наладкі экзэмпляру.

source: Edit language
be: Рэдагаваць мову

source: Edit link
be: Рэдагаваць спасылку

source: Edit menu
be: Рэдагаваць меню

source: Edit menu link
be: Рэдагаваць спасылку меню

source: Edit own comments
be: Рэдагаваць уласныя каментары

source: Edit own webform submissions
be: Рэдагаванне вынікаў сваіх вэбформаў

source: Edit profile
be: Рэдагаваць профіль

source: Edit role
be: Рэдагаваць ролю.

source: Edit rule
be: Рэдагаваць правіла

source: Edit set name
be: Рэдагаваць імя набору

source: Edit shortcut
be: Рэдагаваць хуткую спасылку

source: Edit shortcuts
be: Рэдагаваць хуткія спасылкі

source: Edit string
be: Змяніць радок

source: Edit style
be: Рэдагаваць стыль

source: Edit summary
be: Рэдагаваць рэзюмэ

source: Edit term
be: Рэдагаваць тэрмін

source: Edit terms in %vocabulary
be: Рэдагаваць тэрміны ў %vocabulary

source: Edit the e-mail messages sent to users when they attempt to cancel their accounts.
be: Змяніць змест e-mail паведамленняў, дасылаемыя карыстальнікам, калі яны спрабавалі выдаліць акаўнт.

source: Edit the e-mail messages sent to users who request a new password.
be: Рэдагаваць e-mail паведамленне, якое адпраўляецца тым, хто запытаў новы пароль

source: Edit the welcome e-mail messages sent to new member accounts created by an administrator.
be: Рэдагаваць вітальнае e-mail паведамленне, якое пасылаецца новым удзельнікам, чые акаўнты былі створаны адміністратарам.

source: Edit the welcome e-mail messages sent to new members upon registering, when administrative approval is required.
be: Рэдагаваць вітальнае e-mail паведамленне, якое пасылаецца новым удзельнікам пры рэгістрацыі, калі неабходна адміністратыўнае пацвярджэнне.

source: Edit the welcome e-mail messages sent to new members upon registering, when no administrator approval is required.
be: Рэдагаваць вітальныя e-mail паведамленні, якія пасылаюцца новым удзельнікам падчас рэгістрацыі, калі не патрэбна пацверджання адміністратара.

source: Edit this menu
be: Рэдагаваць дадзенае меню

source: Edit vocabulary
be: Рэдагаваць слоўнік

source: Editing @shortcut
be: Рэдагаванне @shortcut

source: Editing the current shortcut set will affect other users if that set has been assigned to or selected by other users. Granting "Select any shortcut set" permission along with this permission will grant permission to edit any shortcut set.
be: Рэдагаванне бягучага набора хуткіх спасылак будзе ўздзейнічаць на іншых карыстальнікаў, калі гэты набор будзе падпісаны або абраны іншымі карыстальнікамі. Прадстаўце дазвол "Абраць любы набор гарачых спасылак" сярод гэтага дазволу і будзе прадастаўлены дазвол рэдагаваць любы набор хуткіх спасылак.

source: Effect
be: Вынік

source: Egypt
be: Егіпет

source: El Salvador
be: Сальвадор

source: Email
be: Адрас E-mail

source: Email address
be: Email адрас

source: Email settings
be: Наладкі пошты

source: Emphasized
be: Вылучаны націскам

source: Empty
be: Пусты

source: Empty time zone.
be: Пустая зона часу.

source: Enable
be: Уключыць

source: Enable !theme as default theme
be: Уключыць !theme па змаўчанні.

source: Enable !theme theme
be: Уключыць !theme

source: Enable !title
be: Уключыць !title

source: Enable <em>Alt</em> field
be: Дазволіць поле <em>Alt</em>

source: Enable <em>Description</em> field
be: Дазволіць поле <em>Апісанне</em>

source: Enable <em>Display</em> field
be: Уключыць поле <em>Дысплэй</em>

source: Enable <em>Title</em> field
be: Дазволіць поле<em>Title</em>

source: Enable @title menu link
be: Уключыць @title пункт меню

source: Enable access log
be: Актываваць логі дасягу

source: Enable and edit e-mail messages sent to users upon account activation (when an administrator activates an account of a user who has already registered, on a site where administrative approval is required).
be: Улучэнне і рэдагаванне e-mail паведамленняў, якія пасылаюцца карыстальнікам падчас актывацыі акаўнта (калі адміністратар актывізуе акаўнт карыстальніка, які ўжо зарэгістраваўся на сайце, дзе патрабуецца пацвярджэнне адміністратара.)

source: Enable and edit e-mail messages sent to users when their accounts are blocked.
be: Змяніць змест e-mail паведамленняў, дасылаемыя карыстальнікам, калі іх акаўнты заблакаваны.

source: Enable and edit e-mail messages sent to users when their accounts are canceled.
be: Актывізаваць і змяніць e-mail паведамленні, дасылаемыя карыстальнікам, калі іх акаўнты былі выдалены.

source: Enable and set default
be: Уключыць і усталяваць па змаўчанні

source: Enable clean URLs
be: Дазволіць чыстыя URL'ы

source: Enable multilingual support for this content type. If enabled, a language selection field will be added to the editing form, allowing you to select from one of the <a href="!languages">enabled languages</a>. If disabled, new posts are saved with the default language. Existing content will not be affected by changing this option.
be: Уключыць шматмоўную падтрымку для гэтага тыпу змесціва. Калі ўключана гэта опцыя, тады поле выбару мовы дадаецца да формы рэдагавання, якое дазваляе вам выбраць адну з <a href="!languages">уключаных моў</a>. У зваротным выпадку новыя запісы будуць захаваны на стандартнай мове. Змяненне гэтай опцыі ніяк не паўплывае на ўжо існуючае змесціва.

source: Enable multilingual support for this content type. If enabled, a language selection field will be added to the editing form, allowing you to select from one of the <a href="!languages">enabled languages</a>. You can also turn on translation for this content type, which lets you have content translated to any of the installed languages. If disabled, new posts are saved with the default language. Existing content will not be affected by changing this option.
be: Дазвольце падтрымку шматмоўнасці для гэтага тыпу змесціва. Калі яна дазволена, поле абрання мовы будзе дададзенае ў форму рэдагавання і дасць вам магчымасць абіраць адну з <a href="!languages">даступных моваў</a>. Вы можаце таксама ўключаць пераклад тыпу змесціва, які дазваляе вам мець перакладзены на усталяваныя мовы змест. Калі гэта падтрымка забаронена, новыя пасты будуць захаваны з мовай па змоўчанні. Існуючае змесціва не падвяргаецца ўплыву гэтых змен.

source: Enable newly added modules
be: Каб выдаліць модуль @module, трэба спачатку выдаліць модуль: @required_modulesУключыць дададзеныя модулі

source: Enable newly added themes
be: Уключыць нядаўна дададзеныя тэмы

source: Enable or disable clean URLs for your site.
be: Дазволіць альбо забараніць чыстыя URL'ы для вашага сайта.

source: Enable or disable page caching for anonymous users and set CSS and JS bandwidth optimization options.
be: Дазволіць або забараніць старонку кэшыравання для ананімных карыстальнікаў ды ўсталяваць наладкі аптымізацыі CSS і JS.

source: Enable or disable the display of certain page elements.
be: Уключыць або адключыць паказ пэўных элементаў старонак.

source: Enable signatures.
be: Дазволіць подпіс.

source: Enable the personal contact form by default for new users.
be: Дазволіць выкарыстанне персанальнай кантактнай формы новымі юзерамі.

source: Enable theme
be: Уключыць тэму

source: Enable user pictures.
be: Дазволіць малюнак карыстальніка.

source: Enabled
be: Актывавана

source: Enabled ('@value')
be: Уключана ('@value')
